In [7]:
import pandas as pd
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi',  
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'],  
        'Age':[27, 24, 22, 32,  
               33, 36, 27, 32],  
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj', 
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'],  
        'Qualification':['Msc', 'MA', 'MCA', 'Phd', 
                         'B.Tech', 'B.com', 'Msc', 'MA']}
df = pd.DataFrame(data1)
print(df,'\n\n')

print(df.groupby('Name').groups,'\n\n')
gk = df.groupby('Name')
gk.first()

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA


{'Abhi': [7], 'Anuj': [1, 5], 'Gaurav': [4], 'Jai': [0, 2], 'Princi': [3, 6]}

        Age  Address Qualification
Name
Abhi     32  Aligarh            MA
Anuj     24   Kanpur            MA
Gaurav   33  Jaunpur        B.Tech
Jai      27   Nagpur           Msc
Princi   32  Kannuaj           Phd

In [12]:
import pandas as pd
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi',  
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'],  
        'Age':[27, 24, 22, 32,  
               33, 36, 27, 32],  
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj', 
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'],  
        'Qualification':['Msc', 'MA', 'MCA', 'Phd', 
                         'B.Tech', 'B.com', 'Msc', 'MA']}

df = pd.DataFrame(data1)
print(df,'\n\n')

df.groupby(['Name','Qualification'])
print(df.groupby(['Name','Qualification']).groups)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA


{('Abhi', 'MA'): [7], ('Anuj', 'B.com'): [5], ('Anuj', 'MA'): [1], ('Gaurav', 'B.Tech'): [4], ('Jai', 'MCA'): [2], ('Jai', 'Msc'): [0], ('Princi', 'Msc'): [6], ('Princi', 'Phd'): [3]}

In [18]:
import pandas as pd
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi',  
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'],  
        'Age':[27, 24, 22, 32,  
               33, 36, 27, 32], }
df = pd.DataFrame(data1)
print(df,'\n\n')

print(df.groupby(['Name']).sum())
df.groupby(['Name'], sort = False).sum()

     Name  Age
0     Jai   27
1    Anuj   24
2     Jai   22
3  Princi   32
4  Gaurav   33
5    Anuj   36
6  Princi   27
7    Abhi   32


        Age
Name
Abhi     32
Anuj     60
Gaurav   33
Jai      49
Princi   59

        Age
Name
Jai      49
Anuj     60
Princi   59
Gaurav   33
Abhi     32

In [23]:
import pandas as pd
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi',  
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'],  
        'Age':[27, 24, 22, 32,  
               33, 36, 27, 32],  
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj', 
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'],  
        'Qualification':['Msc', 'MA', 'MCA', 'Phd', 
                         'B.Tech', 'B.com', 'Msc', 'MA']}  

df = pd.DataFrame(data1)
print(df,'\n\n')

df.groupby('Name').groups

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

{'Abhi': [7], 'Anuj': [1, 5], 'Gaurav': [4], 'Jai': [0, 2], 'Princi': [3, 6]}

In [3]:
import pandas as pd
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi',  
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'],  
        'Age':[27, 24, 22, 32,  
               33, 36, 27, 32],  
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj', 
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'],  
        'Qualification':['Msc', 'MA', 'MCA', 'Phd', 
                         'B.Tech', 'B.com', 'Msc', 'MA']}
df = pd.DataFrame(data1)
print(df,'\n\n')

grp = df.groupby('Name')
for name, group in grp:
    print(name)
    print(group)
    print(

grp = df.groupby(['Name','Qualification'])
for name,group in grp:
    print(name)
    print(group)
    print()

SyntaxError: invalid syntax (<ipython-input-3-ef494513603c>, line 20)

In [15]:
import pandas as pd
example = {'Team':['Arsenal', 'Manchester United', 'Arsenal', 
                   'Arsenal', 'Chelsea', 'Manchester United', 
                   'Manchester United', 'Chelsea', 'Chelsea', 'Chelsea'], 
                     
           'Player':['Ozil', 'Pogba', 'Lucas', 'Aubameyang', 
                       'Hazard', 'Mata', 'Lukaku', 'Morata',  
                                         'Giroud', 'Kante'],                         
           'Goals':[5, 3, 6, 4, 9, 2, 0, 5, 2, 3] }

df = pd.DataFrame(example)

total_goals = df['Goals'].groupby(df['Team'])         #" ''''''''''''   "
print(total_goals.mean())

Team
Arsenal              5.000000
Chelsea              4.750000
Manchester United    1.666667
Name: Goals, dtype: float64

In [16]:
import pandas as pd 
example = {'Team':['Australia', 'England', 'South Africa', 
                   'Australia', 'England', 'India', 'India', 
                        'South Africa', 'England', 'India'], 
                          
           'Player':['Ricky Ponting', 'Joe Root', 'Hashim Amla', 
                     'David Warner', 'Jos Buttler', 'Virat Kohli', 
                     'Rohit Sharma', 'David Miller', 'Eoin Morgan', 
                                                 'Dinesh Karthik'],                                            
          'Runs':[345, 336, 689, 490, 989, 672, 560, 455, 342, 376], 
            
          'Salary':[34500, 33600, 68900, 49000, 98899, 
                    67562, 56760, 45675, 34542, 31176] } 

df = pd.DataFrame(example)
total_salary = df['Salary'].groupby(df['Team'])
print(total_salary.mean())

Team
Australia       41750.000000
England         55680.333333
India           51832.666667
South Africa    57287.500000
Name: Salary, dtype: float64

In [26]:
import pandas as pd
d = {'id':['1', '2', '3'], 
     'Column 1.1':[14, 15, 16], 
     'Column 1.2':[10, 10, 10], 
     'Column 1.3':[1, 4, 5], 
     'Column 2.1':[1, 2, 3], 
     'Column 2.2':[10, 10, 10], } 

df = pd.DataFrame(d)
print(df)

groupby_dict = {'Column 1.1':'Column 1', 
                'Column 1.2':'Column 1',
                'Column 1.3':'Column 1', 
                'Column 2.1':'Column 2', 
                'Column 2.2':'Column 2' }
df = df.set_index('id')
df = df.groupby(groupby_dict, axis=1).min()
print(df)

  id  Column 1.1  Column 1.2  Column 1.3  Column 2.1  Column 2.2
0  1          14          10           1           1          10
1  2          15          10           4           2          10
2  3          16          10           5           3          10
    Column 1  Column 2
id
1          1         1
2          4         2
3          5         3

In [31]:
import pandas as pd
dict = { 
    "ID":[1, 2, 3], 
    "Movies":["The Godfather", "Fight Club", "Casablanca"], 
    "Week_1_Viewers":[30, 30, 40], 
    "Week_2_Viewers":[60, 40, 80], 
    "Week_3_Viewers":[40, 20, 20] }; 
df = pd.DataFrame(dict)
print(df)


# Create the groupby_dict  
groupby_dict = {"Week_1_Viewers":"Total_Viewers", 
           "Week_2_Viewers":"Total_Viewers", 
           "Week_3_Viewers":"Total_Viewers", 
           "Movies":"Movies" } 
df = df.set_index('ID')
df = df.groupby(groupby_dict, axis=1).sum()
df

   ID         Movies  Week_1_Viewers  Week_2_Viewers  Week_3_Viewers
0   1  The Godfather              30              60              40
1   2     Fight Club              30              40              20
2   3     Casablanca              40              80              20

           Movies  Total_Viewers
ID
1   The Godfather            130
2      Fight Club             90
3      Casablanca            140